const post = {
  "id": "keep-healthy",
  "slug": "keep-healthy",
  "title": "維持健康也是需要身體力行的一種學習",
  "description": "最近是不是也對自己生活的某一部分不滿意，或是看了別人成功達成某個目標而感到羨慕呢？或許可以練習看看「改寫敘事」，溫柔關注自己的變化，也許就能自然地行動起來。",
  "categories": [
    "學習日記",
    "自我成長"
  ],
  "category": "學習日記",
  "categoryLabels": [
    "學習日記",
    "自我成長"
  ],
  "categoryLabel": "學習日記",
  "date": "2025/11/08",
  "featured": true,
  "image": "/blog-images/keep-healthy/image.png",
  "content": "\n# **練習寫下自己的新敘事**\n\n\n![《大局思維》這本書透過行為科學探討並破除自我設限，用小步驟達成大格局職涯目標。|50%](/blog-images/keep-healthy/image-1.png)\n\n\n《大局思維》曾提到，我們常對自己編造故事，跟自己說「我不夠好」「我辦不到」。\n\n> 我們跟自己說的這些故事與暗示，大多都是在確認偏誤（confirmation bias）的幫助下活靈活現。\n\n越想，越鑽牛角尖，我們的心就越熱衷於編造故事來證明自己「什麼都辦不到」⋯🙁\n\n\n作者建議，**把這些故事寫下來，就會發現他們大多沒有可信度。**可以在這些故事旁邊加上新的敘事，內化它，讓他引導自己走向目標。\n\n\n書中的例子是：\n\n> 舊敘事：我不夠好。周遭同事全都比我優秀，一下子就能達成目標。\n>\n> 過程：拿自己跟自己比，別花時間跟別人做比較。每週一次將自己的成就和進展記在日誌中。\n>\n>\n> 新敘事：我為自己感到驕傲，因為我不斷在前進。我的自尊提高了，工作時也更開心。\n>\n>\n\n不斷重複這樣的過程能促使新敘事產生並取代舊的負面敘事。\n\n\n重點在於：**心態和行動是並行的。你要動起來，現在就開始。先試著做一點點看看，啟動了心態的摩擦力，改變就發生了。**\n\n\n在這一次次的微小練習中，累積成對人生結果的深遠影響。\n\n\n---\n\n\n# **重拾減脂計畫，從力行中學習**\n\n\n因為今年的健檢出現了紅字，我開始了一場新的學習。\n\n\n學習的對象不是醫學權威，而是網路上樸實的分享文章，一篇篇網友自行試驗成功的減脂歷程。其實這場學習，早在好幾年前就開始了，你也知道嘛，減肥是大多數人一輩子的課題 🤣\n\n\n在這個過程中，我認為失敗也是必要的。\n\n\n像是在 2021-2022 年那陣子，我的計畫就被有被工作壓力擊垮過。\n\n> 沒辦法，我壓力大就是想亂吃！想喝珍奶啊！\n\n我便這樣一直告訴自己，去忽略吃進嘴裡的東西以及又彈回去的體重。但是那時候努力過的記憶還在，也有個小小的聲音一直告訴自己「不甘心」。\n\n\n---\n\n\n現在趁著職涯的空窗期重整腳步，我重新整理生活節奏，做些微小的無痛修正：\n\n\n![爬文之後覺得 211 餐盤比較適合我，嘗試著做了好幾餐|50%](/blog-images/keep-healthy/image-2.png)\n\n- 下廚時把一部分白飯的量換成肉或蔬菜。\n- 想買手搖的時候告訴自己「今天先不要，過幾天後再買」\n- 吃完飯不馬上躺下來、先在家踏步十分鐘。\n- 餅乾糖果都只先吃別人送的，自己絕不花錢買（喂\n\n一開始只是想讓自己不要那麼罪惡，沒想到漸漸地我開始相信：\n\n> 我其實是能自控的人，不會靠傷害身體來排解壓力，\n>\n> 而且靠自己的力量獲得輕盈而健康的快樂。\n>\n>\n\n然後神奇地發現，這就是用新的敘事去代換掉一直壓著自己的自我暗示，一個讓自己一直不快樂的藉口。\n\n\n**所以一直失敗又怎樣？**\n\n\n**他讓我有對照組可以比較出前後差異，明白到底是什麼關鍵因素在作用，透過新敘事定義自己的練習，我終有一天會接近理想目標。**\n\n\n---\n\n\n在這個過程裡，我不只是調整飲食，也在學著填補知識的空白。我去查資料、理解熱量與減重的關係和運作方式，也試著建立更健康的心態：不讓「變瘦」成為人生唯一的目的，而是讓它幫我更好地生活。\n\n\n這是一種長期的自我教育。\n\n\n寫下並內化這些新敘事，提醒自己：「我有能力重寫生活，也有耐心重新成為我想成為的人。」\n\n\n過程是舒服的，看來這次應該能持續下去吧。\n\n"
}

export default post
