{
  "nav": {
    "home": "home",
    "projects": "projects",
    "about": "about",
    "blog": "blog"
  },
  "home": {
    "greeting": "Hello, I'm ENN!",
    "description": "I'm a passionate UI designer who puts users first. I create intuitive, user-centered interfaces that enhance usability while ensuring smooth collaboration between design and development teams.",
    "moreAboutMe": "More about me",
    "discoverMore": "discover more",
    "carousel": {
      "focusedOn": "I focused on",
      "create": "I create",
      "specialize": "I specialize",
      "do": "I do"
    }
  },
  "about": {
    "title": "Making digital products clear, engaging, and meaningful for users.",
    "readCV": "Read CV",
    "profile": {
      "intro": "Hey, I'm Enn. I've spent the past decade designing digital products across publishing, education, gaming, and government. I enjoy creating work that makes life a little clearer, easier, or more enjoyable for the people who use it.",
      "career": "A big part of my career has been in the education space, where I've led small design teams and shaped end-to-end experiences from early concepts to launch. I'm also an illustrator at heart, often blending visual storytelling with interface design to build products that feel both intuitive and visually engaging."
    },
    "whatIDo": "What I Do",
    "watchMore": "watch more",
    "experience": "Experience",
    "education": "Education",
    "archivedWorks": "Archived Works",
    "mobileTabs": {
      "profile": "Profile",
      "whatIDo": "What I Do",
      "experience": "Experience",
      "education": "Education"
    }
  },
  "projects": {
    "title": "Projects",
    "description": "I've been designing since 2016, combining clear structure with visual storytelling to create work that feels both intuitive and expressive. Partners describe my approach as professional, thoughtful, and meticulous.",
    "caseStudy": "Case Study",
    "comingSoon": "Coming Soon"
  },
  "blog": {
    "title": "Blog",
    "subtitle": "Recording my observations and thoughts on product design, tool usage, and career growth. Currently, content is primarily in Chinese.",
    "all": "All",
    "design": "Design",
    "tooling": "Tools & Practice",
    "self": "Self Growth",
    "spotlight": "Spotlight"
  },
  "common": {
    "contactMe": "CONTACT ME",
    "copyright": "Copyright © Enn Tang"
  }
}
