const post = {
  "id": "work-burnout",
  "slug": "work-burnout",
  "title": "面對工作倦怠，我的覺察與調適",
  "subtitle": "工具分享",
  "description": "草稿文章的描述",
  "category": "自我成長",
  "categoryLabel": "自我成長",
  "date": "2025/01/28",
  "featured": false,
  "spotlight": false,
  "heroImage": "",
  "thumbnailImage": "",
  "author": "Enn Tang",
  "content": "\n大概在 2020 年的時候，察覺自己正在工作倦怠狀態，那時的我有以下的紀錄及反思，提供給也在煩惱的你一點參考。\n\n\n---\n\n\n想到工作就覺得煩躁、對新聞媒體報導的事件憤世忌俗、在辦公室習慣性地大口換氣或嘆氣，這些症頭告訴我：我可能已經陷入工作倦怠。\n\n\n就跟所有在情緒低潮期的人們一樣，我們通常不會立即發覺自己的異狀，而是身心出現了一些徵兆，被身邊的人指出、反應出來後，才有機會正視自己的狀況。當然，也有人選擇否認，而繼續壓抑或忽視下去。\n\n\n# 過往走過陰鬱的經驗\n\n\n對於抑鬱情緒，我已在數年前有過經驗（2014年時，因為感情問題無法克服而選擇休學），那時認為應該求助醫學的力量，而去北醫精神科看過，醫生判斷我只是憂鬱傾向，並不到憂鬱症的程度。那次拿的藥吃完後，我也就沒再就診。\n\n\n後來很長一段時間，我都在情緒持續低落的情況下工作、生活，因為不想讓自己成為別人的負擔。我有時也故意表現得相當積極向上。於是，外表看似正常，但實際上卻有可能隨時崩潰——就看是否觸發臨界點。多虧家人朋友的體諒與支持，以及遇見我現在的老公，心靈才真正被治癒。（羞）\n\n> 如果不是在非常嚴重的情況下，人的心理是強壯的，遭受痛苦時，他可以忽視甚至騙自己：一切都很好，我可以，我沒問題。\n\n但這樣長期下來其實相當不健康。生而為人很無奈的是，我們通常無法選擇自己所處的環境，卻被社會要求不能選擇退出。而當這個環境的負面因素太多，例如政治局勢混亂、自我認同遭受否認、環境污染、工作或生活環境欠佳卻無法脫逃…都有可能壓垮我們的精神。\n\n\n這次陷入的工作倦怠，來得無聲無息，因為我並沒有被施予績效壓力或因為出了包被指責，而是在職務上做了過多調整，導致目前負責的工作範圍與原本預期大不相同。但因為被賦予期待，我不知不覺中**為了迎合上司的期待而忽視自己內心反抗的聲音。**當然，這個職務調整的方向並不是毫無道理，但因為是不熟悉的領域而需要比以往更多的精力去完成，也因此犧牲掉在設計領域耕耘的時間，因此感到相當焦慮。\n\n\n如果最後還是發現做不來，原本熟悉的設計工作也生疏了，那我豈不是落得兩頭空？\n\n\n目前這個問題還無解。在還沒有到達需要談判或直接分手（離職）的狀況下，只能繼續努力看看。不過就算願意努力，自己的情緒和身心健康還是要顧，依照經驗我有一些方法可以用來緩解自己的壓力，提供給跟我遭遇一樣狀況的人參考。\n\n\n# **覺察與接受，這是最重要的**\n\n\n發現自己的確在承受工作倦怠，並且接受自己也有陷入低潮的時候。我們不是聖人更不是鋼鐵人，遇到痛的、不如意的事情會不開心很正常，不須否認自己有脆弱的一面，更沒必要理會指責我們不堅強的人。\n\n\n![陪我度過最低潮時光的書](/blog-images/work-burnout/image-1.jpeg)\n\n\n在我第一次陷入長期抑鬱情緒的那段期間，《是情緒糟，不是你很糟：穿透憂鬱的內觀力量》這本書有給我一點啟發，作者提到：(1)**事件和感受都是中性的。但我們總是為他們加上過多解釋。** (2)一味試圖逃離負面情緒，或只是拚命想著「如何重新振作起來」的方法，反而會讓我們更陷進憂鬱的深淵。\n\n\n一切先從接受自己開始。如果連自己都否認自己，未免也太可憐了。\n\n\n# **運動**\n\n\n這個雖然是老生常談，但透過自己親身經歷，我發現運動真的具有一定的紓壓效果。\n\n\n曾經假日早上覺得對工作毫無期待與熱情可言、下午去健身房踩了半小時腳踏車後，我發現自己心情好多了，回家甚至願意打開電腦預先準備明天的工作文件。\n\n\n不過前提是，不要把運動本身又賦予過多目的性，比如這次運動完我一定要瘦兩公斤，不然只是給自己另一個壓力或失落感來源而已XD\n\n\n# **講出來**\n\n\n對，**講出來。**不過需要挑一下對象，把工作的煩惱講給同事聽之前還是得審視這個人適不適合，當然不是說同事都有機會打小報告，只是如果抱怨的內容跟他有關係，難免又會引發聯想造成不必要的誤會。\n\n\n跟事件本身完全無關的人，也足夠了解你的人，是最理想的傾訴對象。不過，對方可能會給出許多建議或甚至指出自己的不足之處。**目前自己有足夠的雅量及心理建設去接受善意的批評嗎？**可以再多評估一下。如果已經不開心到一個程度，就找一個願意只聽你抱怨而先不給回饋的人，先處理情緒的發洩再面對事情的對錯，也是不錯的策略。\n\n\n暫時找不到人講的時候，寫日記或文章也有頗佳的效果，就像我現在做的事一樣：）\n\n\n# **請偶爾想起你的嗜好**\n\n\n將精神投注在事業久了，會淡忘自己曾經熱愛從事的興趣嗜好。但它們是忠實的，無論你走了多遠，暮然回首，它就在燈火闌珊處默默等著你。對我來說，在忙碌的工作空檔中擠出時間畫畫或做一些羊毛氈作品，永遠能帶來一點成就感與滿足感。\n\n\n![我的嗜好：不時以水彩繪製明信片後寄給朋友。這個興趣已經持續了五年以上。](/blog-images/work-burnout/image-2.jpg)\n\n\n# **後記**\n\n\n其實寫作也是自我療癒與調適的一環。\n\n\n我想，就讓他不計成效地、單純地被執行，就當作是一個紀錄，若來日有所成長，這也是一個很好的回憶吧。\n\n"
}

export default post
