const post = {
  "id": "user-experience",
  "slug": "user-experience",
  "title": "人們會選擇消耗最低能量、獲得最大利益的方式去行動",
  "subtitle": "",
  "description": "",
  "category": "design",
  "categoryLabel": "Design",
  "date": "2026/02/28",
  "featured": false,
  "spotlight": false,
  "heroImage": "",
  "thumbnailImage": "",
  "author": "Enn Tang",
  "content": "\n![再完美的路，都有可能另走捷徑](/blog-images/user-experience/image-1.png)\n\n\n這是我很喜歡的一張迷因圖，可以很好的說明什麼叫設計師與使用者想法的落差（類似的還有很多，但這個最容易在現實中見到XD）\n\n\n![找不到來源的迷因圖QQ 拜託知道的朋友補充給我](/blog-images/user-experience/image-2.webp)\n\n\n你的家中是否也有那麼一兩件電器是你覺得「沒那麼好用的」呢？\n\n\n使用者都會有一套自己的方式使用產品，且不一定會照著說明書規定的走，因為存在個人偏好和障礙，且能夠省力就絕不會選擇費力。\n\n\n做產品設計時，應該時刻提醒自己以「使用者」為中心來思考。設計師認為好用的東西、有時候只有自己覺得而已 🥹\n\n\n## **惰性是人的基本狀態**\n\n\n著名認知心理學者、設計師 Donald Norman 在《好設計不簡單》中提到：\n\n> 惰性是物理世界的基本現象，人們會選擇消耗最低能量、獲得最大利益的方式去行動。\n\n在公園裡常會看到原本不能走的草皮被人另闢蹊徑、穿越以更短的距離「切西瓜」出去。難道是嫌紅磚路不夠美觀或是切合公園的風格嗎？其實人們才不管那麼多，他們只是想省時間懶得走直角而已。\n\n\n## **產品與人的行為的磨合**\n\n\n研究學者邁希爾(CarlMyhill)曾指出：\n\n> 人在使用不良設計產品時，他們留下來的嘗試使用該產品的「足跡」，可以讓我們看出人的使用習慣有時跟產品當初的預設方式不符。\n\n馬路上的車輪打滑的痕跡、座椅和階梯磨損的痕跡，甚至於填表格時未把資料填在設定好的位置，在在告訴設計師人的自然行為指標。\n\n\n什麼都要迎合使用者嗎？\n\n\n當然，產品設計不能處處都迎合使用者的需求——事實上，這也很難辦到，總會需要取捨，有些功能的觸發必須設計得複雜一點（例如不想輕易被啟動的、具有危險性的功能）。\n\n\n本次提到的的概念值得設計者時刻放在心上，畢竟設計是要給人用的、須帶給使用者好處且考慮到他們真正的需要和願望。\n\n"
}

export default post
