const post = {
  "id": "agency",
  "slug": "agency",
  "title": "UI/UX 轉職者先到乙方公司，其實是好選擇",
  "description": "你是否曾想要應徵接案公司的職缺好好磨練，又擔心可能不是一個好選擇呢？或是在「甲方乙方」的說法中迷失方向，眾說紛紜中有如霧裡看花呢？",
  "categories": [
    "職場有感"
  ],
  "category": "職場有感",
  "categoryLabels": [
    "職場有感"
  ],
  "categoryLabel": "職場有感",
  "date": "2026/08/09",
  "featured": false,
  "image": "/blog-images/agency/image.png",
  "content": "\n# 甲方和乙方差在哪裡？\n\n\n「甲方」與「乙方」的俗稱是來自於簽專案合約的時候，發案方通常都是甲方，而負責執行的那一端都稱乙方。對轉職者來說，這兩者的工作職缺差異可能有點模糊。\n\n\n## **甲方：**品牌端**（In-house）**\n\n\n你會長期為某一個品牌或旗下的子品牌服務，通常也都是同產業的圈子。\n\n\n你會持續面對同一批內部 PM、主管，專注研究同一群用戶、持續觀察固定的競爭對手，並在任職期間不斷優化同一套產品或流程。\n\n\n這種環境能讓你深入某個領域、累積產品經營的長期視角，但相對來說從 0 到 1 完整規劃一個新產品的機會比較少。\n\n\n## **乙方：**代理商、接案公司**（Agency）**\n\n\n從小型工作室到具備顧問團隊的大型顧問公司都有。\n\n\n乙方的專案以 case by case 形式進行，你需要在短時間吸收不同產業知識、快速轉換風格，頻繁與不同類型的客戶合作。\n\n\n好處是成長速度快、視野廣、作品集累積得快；缺點是比較難在某一個產品或領域深耕，也較少有機會驗證設計成果（甚至客戶後續可能會自行修改 XD）。\n\n\n# **待在乙方能快速累積實戰經驗與作品**\n\n\n乙方公司服務的是不同產業的客戶，你會在短期間接觸到非常多類型的需求。\n\n\n這對於剛轉職、還在探索自己「喜歡哪種產品或領域」的人來說，特別有幫助。實戰經驗累積得很快，也可以把做過的專案在作品集展示（當然要注意一下是否有保密協議的問題）。\n\n\n你會看到不同公司在意的重點、不同專案的設計節奏，甚至不同 PM、工程師的合作方式。這些都能很快拓展你的視野。\n\n\n## **人脈、機會、思維都更開放**\n\n\n乙方公司的合作網絡通常比較廣，你可能會跟金融、電商、醫療、美妝、教育等產業的人接觸。這些人脈與理解會在未來找工作時意外派上用場。\n\n\n同時，你也不會被某一種風格或流程綁住。因為每個客戶的需求不同，你的技能會被逼著多面向地成長。\n\n\n可以趁這段時間思索自己喜歡的產業或產品類型（to B or to C；遊戲還是生產力工具…等）。\n\n\n## 廣的反面是不夠深\n\n\n一個常被詬病的乙方公司缺點是起薪通常偏低，步調也偏快，不會是一個「舒服的」環境，所以不適合想要上下班時間固定、錢多事少工作的求職者。\n\n\n另外，對長期職涯較重要的議題是，在乙方公司負責的專案在交付後比較少有「長期維護產品」的機會。（孩子生出來之後就送給別人養了）\n\n\n這代表你可能沒有辦法持續追蹤產品成效，也比較少接觸深度的 UX 研究方法。\n\n\n但這些不是不可彌補的缺口：\n\n- 成效追蹤 → 可以自己主動關心客戶後續數據\n- 進階 UX 研究 → 平常用文章閱讀、線上課程補強，或自己進行 side project 來實踐~~（也可以考慮念個碩班）~~\n\n長期產品思維在未來轉到甲方公司時就會自然累積。\n\n\n對正在轉職、還在建立基礎的人來說，這些缺點並不足以掩蓋乙方公司「高密度成長」帶來的好處。\n\n\n# **小結**\n\n\n就我的觀點，乙方公司是轉職 UI/UX 很好的敲門磚，它通常對新手較友善，也歡迎不同背景與經歷的心血加入。\n\n\n我自己轉職也是從乙方開始的，雖然很累但奠定了介面設計的實作經驗。\n\n\n可以好好衡量自己的生活型態（是否能接受快節奏、長工時）後加入，先把基礎打穩、經驗累積起來，再決定要不要轉往甲方公司，會比一開始就硬闖大品牌要輕鬆得多。\n\n"
}

export default post
