const post = {
  "id": "study-with-ai",
  "slug": "study-with-ai",
  "title": "當學習與 AI 同行，是益友也是良師",
  "description": "在科技軟體業或從事產品設計的你，是不是也正在讚嘆 AI 好好用與擔憂他會搶走自己工作之間遊走呢？ 我有一陣子也在這個狀態內，不過隨著時間過去，我變得比較能平靜看待了。",
  "categories": [
    "學習日記"
  ],
  "category": "學習日記",
  "categoryLabels": [
    "學習日記"
  ],
  "categoryLabel": "學習日記",
  "date": "2025/10/29",
  "featured": true,
  "image": "/blog-images/study-with-ai/image.jpg",
  "content": "\n# 有 AI 前的開發節奏容易被低級問題打斷\n\n\nReact 的學習還在很前面的階段，但是我已經處在腦袋要冒煙的狀態了 😂\n\n\n過去要 debug 很花時間，有可能找一整天都沒有結果，有時候不是不會寫，只是眼睛不好或是手抖⋯\n\n\n---\n\n\n我自認在 programming 方面並不具有天賦，頂多就是能夠依樣畫葫蘆，跟隨前人給的範例一步一步刻出來，所以當遇到問題，彈性的解決手法變成我最無法使出的，但這往往也是一個開發者必備的能力。\n\n\n但是現在透過 AI 的話，可以快速幫你發現盲點，不管最新進度寫到哪裡，他都可以給你不錯的改善建議。\n\n\n甚至是某個判斷式少一個等號，原本需要花相當多人力解決的智障問題，現在有機會把 debug 的時間省下來了。\n\n\n過去在乙方公司當 UI/UX，出設計稿之外還要自己切版，我曾經上午要修理一個壞掉的畫面，找到中午要吃飯了都沒測到問題在哪，\n\n\n結果下午發現我只是變數打錯一個字母。\n\n\n當下真的想一拳把電腦打爆，還我吃便當的胃口啊啊啊！！\n\n\n因為這不是我不懂怎麼寫，而是因為人的專注限制而出現的問題…（牽拖？）\n\n\n現在有了AI，可以整個幫你掃過一遍，然後揪出低級錯誤、或針對矛盾的地方給出修正建議，我認為這是是初學者、精神不濟者、耐心低落者最佳良藥。\n\n\n給大家看一個充滿錯誤（低級到令人髮指）的檢查報告：\n\n\n![不同的模型會給你不同風格的回覆方式，Cursor 裡面的 GPT-5 會直截了當的告訴你哪裡錯了；我自己買會員的 ChatGPT 則是會再多給我一點情緒價值。|70%](/blog-images/study-with-ai/image-1.png)\n\n\n# AI 不僅是益友也是良師\n\n\n回到手上的 React 學習進度。\n\n\n有次我被教材轟炸完，疲憊的問 ChatGPT：「雖然教學範例我都能 step by step 照刻出來，可是面對全新的題目就腦筋一片空白⋯」\n\n\n他給了我一個非常基本、但也是我忽略已久的做法：\n\n> 下次你想實作功能時，照這樣寫在筆記裡：  \n> 1️⃣ 我想做的功能是：＿＿＿＿＿  \n> 2️⃣ 需要哪些狀態或變數？  \n> 3️⃣ 哪些事件會觸發變化？  \n> 4️⃣ 哪些部分要重複使用（抽成函式或元件）？  \n> 5️⃣ 整體流程順序是？\n\n他要我開始打程式碼之前先好好把整個運作流程想清楚。\n\n\n我突然發現這跟做平面設計時一樣：動筆之前要先搜集資料、調查 Target audience 性質，畫好草圖之後再進 Photoshop，是一樣的道理。\n\n\n![於是我開始在敲鍵盤之前先把大概的流程和需要的語法寫下來|50%](/blog-images/study-with-ai/image-2.jpeg)\n\n\n嘗試過後發現他教我的心法還挺實用的。\n\n\n在紙上構思可以讓思緒較為清楚，對接下來要打的程式嗎更知其所以然。當然，如果在編輯器開著 AI ，他常常會猜中下一句你要打什麼而提早幫你寫出來，這很方便，但對初學者而言反而會減少一點練習機會就是了。\n\n\n# 學習的未來，會變成什麼樣\n\n\nAI 免除掉從頭手刻程式碼的必要性，這表示以往建立基礎架構、重複 build 元件的工作已經從前端工程消失，所以**只會花時間埋頭苦幹做著同樣事情**的人員的存在必要性可能會被質疑。\n\n\n在 AI 輔助下，或許開發者並不需要背出精確的程式碼，而是要清楚每個語法的邏輯、要應用在什麼情境及解決什麼問題，擁有架構完整 flow 的能力，不是單純的輸出你的時間與勞力就能夠有價值。\n\n\n這是我認為將來的初階開發者會面臨的挑戰，或從另一方面看，是機會點吧。（設計師也是，把敲鍵盤改成拿畫筆或滑鼠一樣可套用）\n\n\n對於我們在學習的人來說呢？\n\n> **使用 AI 可以省下翻閱筆記本與背誦的「輸入」時間，專心的「產出」。**\n\n如果遇到小疑問，可以快速發問獲得解答；省下的腦力，用在需要深入思考的「大問題」。\n\n\n雖然每次想到這個都有相見恨晚之感，但我認為每個時代都有自己的挑戰，知識來得快速的反面就是思考變得稀少，不經查證就盲目全信的狀況也會隨之增多，這是學習者不得不留意的吧。\n\n\n但我還是認為，現在正是學習的絕佳時刻，有一個 24 不停歇、隨問隨答的助手，知識搜集、重組的效率前所未有的高，打破了時空壁壘與體力限制，更有機會精確的把握我們要的答案。\n\n\n有在持續學習，至少比永遠待在原地好，所以何必擔心呢？\n\n"
}

export default post
